import warnings
from brain import map
warnings.filterwarnings('ignore')


#
case_1 = {'age': None,
        'cls': '发热',
        'elems': '口干, 口渴, 口大渴, 心烦, 发热, 汗出, 背恶寒, 心下痞满, 腹胀, 气上冲, 胸满闷, 舌暗红, 白苔, 苔薄, 脉大, 洪脉'}

case_2 = {'age': None,
        'cls': '发热',
        'elems': '发热, 往来寒热, 胸满闷, 口干, 口渴, 呕吐, 纳差, 腹泻, 大便里急后重, 大便见脓血, 舌暗红, 白苔, 苔薄, 脉数, 濡脉, 脉软, 脉伏'}

case_3 = {'age': None,
        'cls': '发热',
        'elems': '发热, 口干, 口渴, 呕吐, 饮水则病情加重, 舌淡红, 白苔, 苔薄, 脉浮, 脉数'}

case_4 = {'age': 5,
        'cls': 'ALL',
        'elems': '呕吐, 腹泻, 手足冷, 四肢厥冷, 意识障碍, 昏迷, 抽搐, 舌淡红, 白苔, 苔薄, 脉微'}

case_5 = {'age': None,
        'cls': '发热',
        'elems': '发热, 恶寒, 头痛, 舌淡红, 白苔, 苔薄, 脉浮, 脉紧'}

case_6 = {'age': None,
        'cls': 'ALL',
        'elems': '受凉病史, 恶寒, 恶心, 舌淡红, 白苔, 苔薄, 脉浮, 脉紧'}

case_7 = {'age': None,
        'cls': '发热',
        'elems': '发热, 无汗, 舌淡红, 白苔, 苔薄, 脉浮, 脉紧'}

case_8 = {'age': 20,
        'cls': 'ALL',
        'elems': '形体瘦弱, 情绪波动病史, 精神失常, 发狂, 月经衍期不至, 少腹胀, 舌暗红, 白苔, 苔薄, 脉沉, 脉紧'}

case_9 = {'age': None,
        'cls': 'ALL',
        'elems': '发热, 汗出, 头汗出, 头痛, 头痛剧烈, 视物模糊, 意识障碍, 言语障碍,大便干结, 大便≥6日未解, 舌暗红, 白苔, 苔薄, 脉大'}

case_10 = {'age': None,
        'cls': 'ALL',
        'elems': '头痛, 头痛剧烈, 呕吐, 中腹痛, 中腹疼痛拒按, 羞明怕光, 眼睛干涩, 舌暗红, 白苔, 苔薄, 脉微, 脉弱'}
#
cases = [case_1, case_2, case_3, case_4, case_5, case_6, case_7, case_8, case_9, case_10]

for case in cases:
    map(case)


#
#
# case_11 = {'age': None,
#         'cls': '发热',
#         'elems': '进食过度病史, 产后, 产后恶露不尽, 腹胀, 发热, 潮热, 心烦, 意识障碍, 烦躁, 舌暗红, 白苔, 苔薄, 脉大, 洪脉'}

# case_12 = {'age': 14,
#         'cls': '发热',
#         'elems': '发热, 胸满闷, 胸痛, 大便干结, 大便＞3日未解, 口干, 口渴, 不欲饮水, 汗出, 舌暗红, 白苔, 苔薄, 洪脉, 脉大'}
#
# case_13 = {'age': None,
#         'cls': 'ALL',
#         'elems': '肠痈, 右下腹疼痛, 少腹痛, 少腹疼痛剧烈, 发热, 汗出, 舌暗红, 白苔, 苔薄, 脉数, 脉紧'}
#
# case_14 = {'age': None,
#         'cls': 'ALL',
#         'elems': '产后, 经期腹痛, 月经后期, 少腹痛, 少腹阵发性疼痛, 中腹痛, 中腹阵发性疼痛, 上腹痛, 上腹胀痛, 心下痞满, 上腹阵发性疼痛, 舌淡红, 白苔, 苔薄, 脉弦'}
#
# case_15 = {'age': 78,
#         'cls': 'ALL',
#         'elems': '形体壮实, 腹泻, 大便里急后重, 失眠, 心烦, 舌暗红, 黄苔, 苔薄, 脉大'}
#
# case_16 = {'age': None,
#         'cls': 'ALL',
#         'elems': '意识障碍, 嗜睡, 纳差, 失眠, 舌淡红, 白苔, 苔薄, 脉虚, 脉大'}
#
# case_17 = {'age': None,
#         'cls': 'ALL',
#         'elems': '意识障碍, 谵语, 精神失常, 腹泻, 目赤, 胸满闷, 舌暗红, 苔薄, 黄苔, 黑苔, 苔燥, 脉沉, 脉细, 脉伏'}
#
# case_18 = {'age': None,
#         'cls': 'ALL',
#         'elems': '腹胀, 中腹痛, 大便干结, 大便≥6日未解, 舌淡红, 白苔, 苔薄, 脉迟, 脉弱'}
#
# case_19 = {'age': 40,
#         'cls': 'ALL',
#         'elems': '意识障碍, 昏迷, 舌淡红, 白苔, 苔薄, 脉弦, 脉大'}
#
# case_20 = {'age': 19,
#         'cls': 'ALL',
#         'elems': '受凉病史, 妊娠, 妊娠恶阻, 呕吐, 纳差, 发热, 咳嗽, 痰白, 痰清稀, 大便干结, 形体瘦弱, 形神倦怠, 皮肤干瘪, 舌淡红, 白苔, 苔薄, 脉滑, 脉数, 脉实'}
#
#
# cases = [case_11, case_12, case_13, case_14, case_15, case_16, case_17, case_18, case_19, case_20]

# for case in cases:
#         map(case)


#
# case_21 = {'age': None,
#         'cls': 'ALL',
#         'elems': '腹泻, 呕吐, 全腹痛, 全腹阵发性疼痛, 面色赤, 舌绛, 黄苔, 苔薄, 脉细, 脉数'}
#
# case_22 = {'age': None,
#         'cls': '发热',
#         'elems': '咽痛, 发热, 失眠, 纳差, 大便干结, 舌暗红, 白苔, 苔薄, 洪脉, 脉大'}
#
# case_23 = {'age': None,
#         'cls': 'ALL',
#         'elems': '吐血, 目赤, 唇干, 咽痛, 舌起芒刺, 舌淡红, 白苔, 苔薄, 洪脉, 脉大, 脉细'}
#
# case_24 = {'age': None,
#         'cls': 'ALL',
#         'elems': '服温热食品药物病史, 鼻衄, 舌暗红, 白苔, 苔薄, 洪脉, 脉大, 脉数'}

# case_25 = {'age': 29,
#         'cls': '发热',
#         'elems': '经水适来, 发热, 恶寒, 往来寒热, 意识障碍, 谵语, 口苦, 咽干, 头晕, 胸满闷, 胁下胀满, 心烦, 呕吐, 纳差, 形神倦怠, 神情默默, 大便干结, 大便≥6日未解, 月经后期, 月经量少, 舌暗红, 白苔, 苔薄, 脉弦, 脉数'}
#
# case_26 = {'age': 65,
#         'cls': '发热',
#         'elems': '受凉病史, 恶寒, 恶风, 发热, 无汗, 头痛, 颈项强痛, 肢体疼痛, 肢体酸痛, 口干, 舌淡白, 苔薄, 白苔, 脉浮, 脉数'}
#
# case_27 = {'age': 17,
#         'cls': '发热',
#         'elems': '受凉病史, 恶寒, 发热, 无汗, 口干, 不欲饮水, 头痛, 肢体疼痛, 肢体酸痛, 背痛, 腰痛, 咳嗽, 痰白, 舌淡白, 苔薄, 白苔, 脉浮, 脉数'}
#
# case_28 = {'age': 45,
#         'cls': 'ALL',
#         'elems': '形神倦怠, 面色萎白, 颜面浮肿, 畏寒怕冷, 手足冷, 心悸, 短气, 口淡无味, 呕吐, 呕吐清水, 口多涎沫, 不欲饮水, 纳差, 腹胀, 便溏, 小便不利, 小便色清, 肢体浮肿, 舌淡白, 舌青, 白苔, 苔厚, 苔腻, 脉沉, 脉细'}
#
# case_29 = {'age': None,
#         'cls': '发热',
#         'elems': '下之后, 发热, 恶寒, 无汗, 头痛, 肢体疼痛, 关节疼痛, 咽痛, 扁桃体化脓, 脓痰, 口渴, 小便不利, 全腹痛, 腹泻, 舌暗红, 白苔, 苔薄, 脉微, 脉缓'}
#
# case_30 = {'age': 76,
#         'cls': '发热',
#         'elems': '受凉病史, 发热, 畏寒怕冷, 往来寒热, 头痛, 头晕, 口干, 口苦, 纳差, 颈部淋巴结肿大, 舌红, 白苔, 苔薄, 苔腻, 脉弦, 脉紧'}
#
#
#
# cases = [case_21, case_22, case_23, case_24, case_25, case_26, case_27, case_28, case_29, case_30]
# for case in cases:
#         map(case)


#
# case_31 = {'age': 48,
#         'cls': '发热',
#         'elems': '发热, 汗出, 口干, 口渴, 大便干结, 大便≥6日未解, 舌起芒刺, 舌暗红, 苔薄, 黑苔, 洪脉, 脉大, 脉实, 脉数'}
#
# case_32 = {'age': 35,
#         'cls': '发热',
#         'elems': '受凉病史, 形体瘦弱, 形神倦怠, 面色萎黄, 周身沉重乏力, 头晕, 发热, 恶寒, 往来寒热, 汗出, 潮热, 胸满闷, 心烦, 意识障碍, 烦躁, 舌暗红, 白苔, 苔少, 脉沉, 脉细, 脉弱'}
#
# case_33 = {'age': None,
#         'cls': 'ALL',
#         'elems': '发热, 黄疸, 巩膜黄, 身黄如橘子色, 肌衄, 意识障碍, 昏迷, 大便干结, 大便≥6日未解, 舌暗红, 苔薄, 黄苔, 脉散'}
#
# case_34 = {'age': None,
#         'cls': 'ALL',
#         'elems': '发热, 头痛, 肢体疼痛, 经水适来, 少腹痛, 少腹疼痛拒按, 意识障碍, 烦躁, 谵语, 精神失常, 发狂, 言语不利, 听力下降, 纳差, 大便干结, 小便短赤, 面色萎黄, 面色赤, 手足冷, 手足厥冷, 唇色紫暗, 舌红, 黑苔, 苔燥, 苔薄, 脉细, 脉数, 脉微'}
#
# case_35 = {'age': 50,
#         'cls': 'ALL',
#         'elems': '过食寒凉病史, 小便不利, 舌淡红, 白苔, 苔薄, 脉沉, 脉细'}
#
# case_36 = {'age': None,
#         'cls': 'ALL',
#         'elems': '腹胀, 少腹痛, 少腹胀痛, 少腹疼痛剧烈, 腹中有积聚, 大便干结, 小便不利, 呕吐, 手足冷, 手足厥冷, 舌淡红, 白苔, 苔薄, 脉伏, 脉沉'}
#
# case_37 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 恶寒, 头痛, 口渴, 面色赤, 意识障碍, 谵语, 烦躁, 大便干结, 大便≥6日未解, 无汗, 舌暗红, 白苔, 苔薄, 脉细, 脉涩'}
#
# case_38 = {'age': None,
#         'cls': 'ALL',
#         'elems': '少腹痛, 少腹疼痛拒按, 少腹疼痛剧烈, 大便干结, 舌暗红, 苔薄, 黄苔, 苔燥, 脉沉, 脉细'}
#
# case_39 = {'age': 15,
#         'cls': 'ALL',
#         'elems': '肢体无力, 肢体疼痛, 下肢疼痛, 肢体麻木, 肢体感觉障碍, 胸满闷, 喘息, 舌淡红, 白苔, 苔薄, 脉浮, 脉细'}
#
# case_40 = {'age': 10,
#         'cls': 'ALL',
#         'elems': '鼻塞流涕, 头痛, 恶寒, 无汗, 舌淡红, 白苔, 苔薄, 脉浮, 脉实'}
#
# cases = [case_31, case_32, case_33, case_34, case_35, case_36, case_37, case_38, case_39, case_40]
# for case in cases:
#         map(case)


#
# case_41 = {'age': 74,
#         'cls': 'ALL',
#         'elems': '便秘, 大便干结, 心下硬满, 上腹痛, 舌暗红, 白苔, 苔薄, 脉弦, 脉大'}
#
#
# case_42 = {'age': 51,
#         'cls': 'ALL',
#         'elems': '鼻衄, 心悸, 面色赤, 舌暗红, 白苔, 苔薄, 脉浮, 脉大'}
#
# case_43 = {'age': 34,
#         'cls': 'ALL',
#         'elems': '上腹痛, 呕吐, 怕食寒凉, 畏寒怕冷, 手足冷, 形神倦怠, 劳累时病情加重, 腹中有积聚, 舌淡红, 白苔, 苔薄, 脉迟, 脉弱'}
#
# case_44 = {'age': 64,
#         'cls': 'ALL',
#         'elems': '胸满闷, 喘息, 形体壮实, 胁下痛, 胁下胀满, 咽干, 口渴, 舌暗红, 白苔, 苔薄, 脉沉, 脉实'}
#
# case_45 = {'age': 57,
#         'cls': 'ALL',
#         'elems': '肛周疼痛, 肛周红肿, 小便不利, 少腹胀, 少腹痛, 少腹胀痛, 失眠, 大便干结, 大便＞3日未解, 舌暗红, 白苔, 苔薄, 脉沉, 脉实, 脉迟'}
#
# case_46 = {'age': 22,
#         'cls': 'ALL',
#         'elems': '纳差, 心下痞满, 胁下胀满, 大便干结, 大便＞3日未解, 大便≥6日未解, 手足冷, 肢体疼痛, 肢体酸痛, 肩关节疼痛, 闭经, 形体消瘦, 舌淡红, 白苔, 苔薄, 脉迟, 脉弱, 脉沉'}
#
# case_47 = {'age': 17,
#         'cls': '发热',
#         'elems': '发热, 畏寒怕冷, 汗出, 手足冷, 手足厥冷, 短气, 语声低微, 面色赤, 周身沉重乏力, 不欲饮水, 白苔, 苔薄, 舌青, 苔水滑, 脉沉, 脉细, 浮大中空脉'}
#
# case_48 = {'age': 48,
#         'cls': 'ALL',
#         'elems': '皮疹, 皮疹暗红, 身痒, 恶风, 畏寒怕冷, 背恶寒, 短气, 胸满闷, 舌暗红, 苔薄, 白苔, 脉沉, 脉迟'}
#
# case_49 = {'age': 27,
#         'cls': '发热',
#         'elems': '产后, 发热, 恶寒, 恶风, 汗出, 恶心, 呕吐, 纳差, 心下痞满, 上腹痛, 上腹胀痛, 舌淡白, 苔薄, 白苔, 齿痕舌, 脉浮, 脉细, 脉数'}
#
# case_50 = {'age': 30,
#         'cls': 'ALL',
#         'elems': '猩红热, 皮疹, 发热, 恶寒, 无汗, 咽痛, 意识障碍, 谵语, 牙关紧闭, 舌暗红, 黄苔, 苔薄, 苔腻, 脉数'}

# cases = [case_41, case_42, case_43, case_44, case_45, case_46, case_47, case_48, case_49, case_50]
# for case in cases:
#         map(case)
# 

#
#
# case_51 = {'age': 45,
#         'cls': 'ALL',
#         'elems': '疟疾, 发热, 往来寒热（热多寒少）, 口干, 口渴, 心烦, 汗出, 舌暗红, 苔薄, 黄苔, 苔腻, 洪脉, 脉实, 脉大, 脉数'}
#
# case_52 = {'age': None,
#         'cls': 'ALL',
#         'elems': '肢体疼痛, 肢体痉挛性疼痛, 肢体屈伸不利, 肢体游走性疼痛, 舌淡红, 白苔, 苔薄, 脉弦, 脉实'}
#
# case_53 = {'age': 36,
#         'cls': 'ALL',
#         'elems': '头痛, 头痛剧烈, 面色赤, 目赤, 舌暗红, 白苔, 苔薄, 苔腻, 脉弦, 脉缓, 脉滑, 脉大'}
#
# case_54 = {'age': 64,
#         'cls': 'ALL',
#         'elems': '服用温热食品药物病史, 发热, 口腔溃疡, 溃疡出血, 口唇红肿, 心烦, 唇色红赤, 形神倦怠, 舌红, 白苔, 苔厚, 苔腻, 脉弦, 脉细, 脉数'}
#
# case_55 = {'age': 26,
#         'cls': 'ALL',
#         'elems': '口干, 口渴, 口大渴, 纳差, 小便短赤, 形神倦怠, 情绪惊恐, 舌红, 白苔, 苔薄, 苔燥, 脉细, 脉数'}
#
# case_56 = {'age': 30,
#         'cls': 'ALL',
#         'elems': '腹泻, 胸满闷, 喘息, 舌淡红, 白苔, 苔薄, 脉紧'}
#
# case_57 = {'age': None,
#         'cls': 'ALL',
#         'elems': '肠痈, 少腹痛, 右下腹疼痛, 少腹疼痛拒按, 少腹压痛, 少腹疼痛剧烈, 腹中热, 舌红, 白苔, 苔薄, 脉沉, 脉涩'}
#
# case_58 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 恶风, 肢体疼痛, 关节疼痛, 腰痛, 胸满闷, 喘息, 无汗, 舌淡红, 白苔, 苔薄, 脉浮, 脉紧'}
#
# case_59 = {'age': None,
#         'cls': 'ALL',
#         'elems': '形体瘦弱, 形神倦怠, 周身沉重乏力, 消谷善饥, 舌淡红, 白苔, 苔薄, 脉沉, 脉弱'}
#
# case_60 = {'age': None,
#         'cls': 'ALL',
#         'elems': '声音嘶哑, 舌淡红, 白苔, 苔薄'}
#
# cases = [case_51, case_52, case_53, case_54, case_55, case_56, case_57, case_58, case_59, case_60]
# for case in cases:
#         map(case)
#
# case_61 = {'age': None,
#         'cls': 'ALL',
#         'elems': '全腹痛, 腹泻, 便溏, 舌淡白, 白苔, 苔薄, 胖大舌, 脉紧'}
#
# case_62 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 汗出, 大便干结, 意识障碍, 谵语, 舌暗红, 苔薄, 黑苔, 裂纹舌, 脉沉, 脉数'}
#
# case_63 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 口干, 口渴, 唇干, 心烦, 意识障碍, 谵语, 听力下降, 舌红, 白苔, 苔薄, 脉数'}
#
# case_64 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 唇干, 口干, 意识障碍, 昏迷, 谵语, 手足冷, 听力下降, 舌红, 白苔, 苔薄, 脉细'}
#
# case_65 = {'age': None,
#         'cls': 'ALL',
#         'elems': '产后, 少腹痛, 腹中冷, 少腹冷, 舌淡白, 白苔, 苔薄, 脉弱'}
#
# case_66 = {'age': 22,
#         'cls': 'ALL',
#         'elems': '腹胀, 胸满闷, 胁下胀满, 肢体浮肿, 白带增多, 白带色黄, 白带臭秽, 大便干结, 大便＞3日未解, 面色青黄, 舌红, 黄苔, 苔薄, 苔燥, 脉沉, 脉实'}
#
# case_67 = {'age': None,
#         'cls': 'ALL',
#         'elems': '胸满闷, 痰多, 鼻衄, 口腔出血, 意识障碍, 昏迷, 手足冷, 手足厥冷, 舌淡红, 白苔, 苔薄, 脉沉, 脉细, 脉弱'}
#
# case_68 = {'age': 18,
#         'cls': '发热',
#         'elems': '恶寒, 发热, 手足冷, 手足厥冷, 舌淡红, 白苔, 苔薄, 脉浮, 脉弱, 脉迟'}
#
# case_69 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 恶寒, 无汗, 头痛, 颈项强痛, 腰痛, 意识障碍, 烦躁, 舌暗红, 苔薄, 白苔, 脉浮, 脉紧'}
#
# case_70 = {'age': None,
#         'cls': '发热',
#         'elems': '恶寒, 发热, 头痛, 颈项强痛, 背痛, 腰痛, 无汗, 舌淡红, 苔薄, 白苔, 脉浮, 脉紧'}
#
# cases = [case_61, case_62, case_63, case_64, case_65, case_66, case_67, case_68, case_69, case_70]
# for case in cases:
#         map(case)


#
# case_71 = {'age': None,
#         'cls': 'ALL',
#         'elems': '胸痛, 上腹痛, 咳嗽, 纳差, 舌淡红, 白苔, 苔薄, 脉弦, 脉滑'}
#
# case_72 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 汗出, 上腹痛, 口干, 意识障碍, 谵语, 痫性发作, 舌暗红, 苔厚, 苔腻, 黄苔, 灰苔, 黑苔, 脉沉, 脉滑, 脉实'}
#
# case_73 = {'age': None,
#         'cls': 'ALL',
#         'elems': '疟疾, 汗出, 大汗出, 心慌, 头晕, 形神怯弱, 形神倦怠, 舌淡红, 白苔, 苔薄, 脉虚, 脉微'}
#
# case_74 = {'age': None,
#         'cls': 'ALL',
#         'elems': '上腹痛, 中腹痛, 呕吐, 腹泻, 四肢厥冷, 汗出, 大汗出, 口鼻气息冷, 舌淡红, 苔薄, 白苔, 脉沉, 脉细, 脉迟'}
#
# case_75 = {'age': 3,
#         'cls': '发热',
#         'elems': '下之后, 胸满闷, 喘息, 哮鸣音, 发热, 汗出, 纳差, 失眠, 舌暗红, 白苔, 苔薄, 洪脉, 大脉, 脉数'}
#
# case_76 = {'age': None,
#         'cls': 'ALL',
#         'elems': '疟疾, 发热, 无汗, 舌淡红, 白苔, 苔薄, 洪脉, 脉大, 浮大中空脉'}
#
# case_77 = {'age': 40,
#         'cls': '发热',
#         'elems': '发热, 口干, 口渴, 喜饮食寒凉, 便血, 周身沉重乏力, 言语不利, 意识障碍, 昏迷, 舌起芒刺, 舌暗红, 白苔, 苔薄, 脉滑'}
#
# case_78 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 经水适来, 意识障碍, 谵语, 烦躁, 精神失常, 发狂, 肌衄, 白㾦, 多食善饥, 失眠, 舌暗红, 白苔, 苔薄, 脉细, 脉实, 脉数, 脉弦'}
#
# case_79 = {'age': 21,
#         'cls': 'ALL',
#         'elems': '妊娠, 先兆流产, 腰酸, 少腹痛, 少腹坠胀, 阴道出血, 舌红, 苔薄, 苔腻, 脉细, 脉弦'}
#
# case_80 = {'age': 10,
#         'cls': 'ALL',
#         'elems': '遗尿, 心烦, 口干, 口渴, 纳差, 小便不利, 小便频数, 少腹胀, 形体瘦弱, 舌暗红, 白苔, 苔薄, 苔腻, 脉数, 脉濡, 脉软'}

# cases = [case_71, case_72, case_73, case_74, case_75, case_76, case_77, case_78, case_79, case_80]
# for case in cases:
#         map(case)

#
# case_81 = {'age': 62,
#         'cls': '发热',
#         'elems': '发热, 恶寒, 往来寒热, 手足冷, 头晕, 心悸, 形神倦怠, 周身沉重乏力, 口淡无味, 纳差, 便溏, 腹泻, 唇色紫暗, 面色萎黄, 舌淡白, 胖大舌, 白苔, 苔薄, 灰苔, 苔腐, 脉细, 脉弦, 脉数, 脉弱'}
#
# case_82 = {'age': 46,
#         'cls': 'ALL',
#         'elems': '眩晕, 呕吐, 耳鸣, 心烦, 失眠, 羞明怕光，恶闻声响, 口干, 口苦, 畏寒怕冷, 便溏, 舌红, 白苔, 苔薄, 苔水滑, 脉弦, 脉弱'}
#
# case_83 = {'age': 52,
#         'cls': 'ALL',
#         'elems': '外伤病史, 头痛, 口干, 口渴, 意识障碍, 昏迷, 腹胀, 大便干结, 大便＞3日未解, 小便短赤, 舌红, 白苔, 苔薄, 脉沉, 脉实'}

# case_84 = {'age': 70,
#         'cls': 'ALL',
#         'elems': '疟疾, 发热, 无汗, 口渴, 心烦, 意识障碍, 烦躁, 舌暗红, 白苔, 苔薄, 烦躁, 脉数, 脉大'}
#
# case_85 = {'age': 64,
#         'cls': 'ALL',
#         'elems': '呕吐, 腹泻, 手足冷, 四肢厥冷, 意识障碍, 嗜睡, 谵语, 烦躁, 舌淡白, 白苔, 苔薄, 脉微, 脉沉, 脉细'}
#
# case_86 = {'age': 12,
#         'cls': 'ALL',
#         'elems': '呕吐, 吐血, 胸满闷, 纳差, 大便干结, 大便＞3日未解, 小便短赤, 上腹痛, 上腹压痛, 舌暗红, 苔薄, 白苔, 苔腻, 脉弦, 脉滑'}
#
# case_87 = {'age': 37,
#         'cls': '发热',
#         'elems': '发热, 恶风, 头痛, 手足冷, 周身沉重乏力, 小便不利, 舌淡红,  白苔, 苔腻, 黑苔, 脉弦, 脉迟'}
#
# case_88 = {'age': 14,
#         'cls': 'ALL',
#         'elems': '中腹痛, 中腹压痛, 腹胀, 心下痞满, 腹泻, 便血, 便血出血量大, 纳差, 形神倦怠, 面色赤, 舌暗红, 白苔, 苔薄, 脉实'}
#
# case_89 = {'age': None,
#         'cls': '发热',
#         'elems': '发热, 汗出, 口干, 口渴, 头面红肿疼痛, 头痛, 嗳气, 腹胀, 大便干结, 小便短赤, 意识障碍, 昏迷, 舌暗红, 苔薄, 黄苔, 脉大'}
#
# case_90 = {'age': 30,
#         'cls': 'ALL',
#         'elems': '疟疾, 发热, 往来寒热, 意识障碍, 谵语, 烦躁, 昏迷, 中腹痛, 纳差, 舌暗红, 白苔, 苔薄, 脉弦, 脉细, 濡脉, 脉软'}
#
# cases = [case_81, case_82, case_83, case_84, case_85, case_86, case_87, case_88, case_89, case_90]
# for case in cases:
#         map(case)

#

#
# case_91 = {'age': 5,
#         'cls': 'ALL',
#         'elems': '受凉病史, 颈项强痛, 汗出, 头汗出, 口干, 纳差, 舌淡红, 白苔, 苔薄, 脉浮'}
#
# case_92 = {'age': 47,
#         'cls': 'ALL',
#         'elems': '头痛, 形神倦怠, 手足冷, 恶寒, 无汗, 不欲饮水, 舌淡白, 苔薄, 白苔, 脉沉, 脉细'}
#
# case_93 = {'age': 27,
#         'cls': '发热',
#         'elems': '发热, 汗出, 头痛, 头胀痛, 心烦, 恶心, 呕吐, 喜饮食寒凉, 大便干结, 大便＞3日未解, 舌暗红, 白苔, 苔厚, 脉弦, 脉数'}
#
# case_94 = {'age': 45,
#         'cls': 'ALL',
#         'elems': '上腹痛, 上腹阵发性疼痛, 腹胀, 反酸, 恶心, 呕吐, 口多涎沫, 心烦, 不欲饮水, 小便不利, 心悸, 舌淡红, 苔薄, 白苔, 苔腻, 脉沉, 脉细, 脉弦'}
#
# case_95 = {'age': 30,
#         'cls': 'ALL',
#         'elems': '腹泻, 自利清水, 心下痞满, 上腹痛, 上腹胀痛, 纳差, 嗳气, 咽干, 不欲饮水, 腹中肠鸣, 腹胀, 周身沉重乏力, 舌暗红, 苔薄, 白苔, 苔腻, 脉弦, 脉滑'}
#
# case_96 = {'age': 15,
#         'cls': '发热',
#         'elems': '发热, 恶寒, 汗出, 头痛, 呕吐, 纳差, 口干, 周身沉重乏力, 下肢乏力, 舌淡红, 苔薄, 白苔, 脉弦, 脉细'}
#
# case_97 = {'age': 31,
#         'cls': 'ALL',
#         'elems': '妊娠, 中腹痛, 腹泻, 大便见黏液, 大便见脓血, 大便里急后重, 恶心, 纳差, 畏寒怕冷, 小便短赤, 舌红, 苔薄, 白苔, 脉沉, 脉细, 脉滑, 脉数'}
#
# case_98 = {'age': None,
#         'cls': 'ALL',
#         'elems': '过食寒凉病史, 受凉病史, 身冷, 手足冷, 汗出, 自汗, 口干, 意识障碍, 烦躁, 恶热, 舌淡红, 苔薄, 白苔, 浮大中空脉, 脉数, 脉虚, 脉散'}
#
# case_99 = {'age': 60,
#         'cls': 'ALL',
#         'elems': '上腹痛, 上腹疼痛剧烈, 肢体疼痛, 关节疼痛, 肩关节疼痛, 肢体胀痛, 小便频数, 舌淡红, 苔薄, 白苔, 脉微, 脉弱'}
#
# case_100 = {'age': 7,
#         'cls': '发热',
#         'elems': '发汗后, 下之后, 发热, 咳嗽, 口干, 口渴, 上腹痛, 上腹压痛, 纳差, 心烦, 心中懊恼, 失眠, 舌暗红, 苔薄, 白苔, 脉浮, 脉滑'}
#
# cases = [case_91, case_92, case_93, case_94, case_95, case_96, case_97, case_98, case_99, case_100]
# for case in cases:
#     map(case)



